#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.azurerm_log_analytics_workspace.log_workspace: Reading...
data.azurerm_resource_group.main_group: Reading...
data.azurerm_storage_account.log_storage_account: Reading...
data.azurerm_resource_group.main_group: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group]
data.azurerm_virtual_network.virtual_network: Reading...
data.azurerm_public_ip.public_ip: Reading...
data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network]
data.azurerm_subnet.api_gateway_subnet: Reading...
data.azurerm_subnet.api_gateway_subnet: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-gateway-subnet]
data.azurerm_log_analytics_workspace.log_workspace: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace]
data.azurerm_public_ip.public_ip: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/publicIPAddresses/fiap-tech-challenge-public-ip]
data.azurerm_storage_account.log_storage_account: Read complete after 1s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.Storage/storageAccounts/sandubalog]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_gateway.app_gateway will be created
  + resource "azurerm_application_gateway" "app_gateway" {
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "fiap-tech-challenge-application-gateway"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "fiap-tech-challenge-main-group"
      + tags                        = {
          + "environment" = "development"
        }

      + backend_address_pool {
          + fqdns        = [
              + "172.210.124.176",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "fiap-tech-challenge-application-gateway-api-backend-pool"
        }
      + backend_address_pool {
          + fqdns        = [
              + "sanduba-auth-function.azurewebsites.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "fiap-tech-challenge-application-gateway-auth-backend-pool"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "fiap-tech-challenge-application-gateway-api-http-settings"
          + pick_host_name_from_backend_address = true
          + port                                = 9000
          + probe_id                            = (known after apply)
          + probe_name                          = "api-health-probe"
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "fiap-tech-challenge-application-gateway-auth-http-settings"
          + path                                = "/api/auth"
          + pick_host_name_from_backend_address = true
          + port                                = 443
          + probe_id                            = (known after apply)
          + protocol                            = "Https"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "fiap-tech-challenge-application-gateway-public-ip-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/publicIPAddresses/fiap-tech-challenge-public-ip"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "fiap-tech-challenge-application-gateway-public-ip-port"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "fiap-gateway-ip-configuration"
          + subnet_id = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-gateway-subnet"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "fiap-tech-challenge-application-gateway-public-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "fiap-tech-challenge-application-gateway-public-ip-port"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "fiap-tech-challenge-application-gateway-public-ip-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "api-health-probe"
          + path                                      = "/health"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id   = (known after apply)
          + backend_http_settings_id  = (known after apply)
          + http_listener_id          = (known after apply)
          + http_listener_name        = "fiap-tech-challenge-application-gateway-public-ip-http-listener"
          + id                        = (known after apply)
          + name                      = "fiap-tech-challenge-application-gateway-services-routing-rule"
          + priority                  = 1
          + redirect_configuration_id = (known after apply)
          + rewrite_rule_set_id       = (known after apply)
          + rule_type                 = "PathBasedRouting"
          + url_path_map_id           = (known after apply)
          + url_path_map_name         = "fiap-tech-challenge-gateway-route-paths"
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }

      + url_path_map {
          + default_backend_address_pool_id    = (known after apply)
          + default_backend_address_pool_name  = "fiap-tech-challenge-application-gateway-auth-backend-pool"
          + default_backend_http_settings_id   = (known after apply)
          + default_backend_http_settings_name = "fiap-tech-challenge-application-gateway-auth-http-settings"
          + default_redirect_configuration_id  = (known after apply)
          + default_rewrite_rule_set_id        = (known after apply)
          + id                                 = (known after apply)
          + name                               = "fiap-tech-challenge-gateway-route-paths"

          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "fiap-tech-challenge-application-gateway-auth-backend-pool"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "fiap-tech-challenge-application-gateway-auth-http-settings"
              + id                         = (known after apply)
              + name                       = "auth-service"
              + paths                      = [
                  + "/auth",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "fiap-tech-challenge-application-gateway-api-backend-pool"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "fiap-tech-challenge-application-gateway-api-http-settings"
              + id                         = (known after apply)
              + name                       = "customer-service"
              + paths                      = [
                  + "/cliente",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "fiap-tech-challenge-application-gateway-api-backend-pool"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "fiap-tech-challenge-application-gateway-api-http-settings"
              + id                         = (known after apply)
              + name                       = "order-service"
              + paths                      = [
                  + "/pedido",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "fiap-tech-challenge-application-gateway-api-backend-pool"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "fiap-tech-challenge-application-gateway-api-http-settings"
              + id                         = (known after apply)
              + name                       = "cart-service"
              + paths                      = [
                  + "/carrinho",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "fiap-tech-challenge-application-gateway-api-backend-pool"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "fiap-tech-challenge-application-gateway-api-http-settings"
              + id                         = (known after apply)
              + name                       = "menu-service"
              + paths                      = [
                  + "/cardapio",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.application_gateway_monitor will be created
  + resource "azurerm_monitor_diagnostic_setting" "application_gateway_monitor" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace"
      + name                           = "fiap-tech-challenge-application-gateway-monitor"
      + storage_account_id             = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.Storage/storageAccounts/sandubalog"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ApplicationGatewayAccessLog"
        }
      + enabled_log {
          + category = "ApplicationGatewayFirewallLog"
        }
      + enabled_log {
          + category = "ApplicationGatewayPerformanceLog"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cangelosilima, Action: `pull_request`*